app/Controllers/UsuarioController.php

SELECT *
FROM `empresa`
---
    public function new(){
        $empresaModel = new \App\Models\EmpresaModel();
        $empresas = $empresaModel->findAll();